import React from "react";
import { FaUsers } from "react-icons/fa";

const AboutUs = () => {
  return (
    <div className="flex flex-col items-center text-center p-6 my-5">
      {/* Title with Icon */}
      <h1 className="text-4xl font-bold text-orange-600/75 flex items-center gap-2">
        <FaUsers className="text-orange-600" /> معلومات عنا
      </h1>

      {/* Description Section */}
      <p className="text-lg mt-6 max-w-[1300px] leading-relaxed text-gray-700">
        يهدف موقع اعرف قسمك كلية اداب عين شمس إلى تقديم دليل كامل يساعد الطلاب
        في اختيار القسم المناسب لهم داخل كلية الآداب بجامعة عين شمس، استنادًا
        إلى اهتماماتهم وقدراتهم. يساهم الموقع في تقديم معلومات شاملة ومحدثة حول
        الأقسام المختلفة، بالإضافة إلى تجارب حقيقية من طلاب سبقوك، مما يسهل عليك
        اتخاذ القرار الأنسب لمستقبلك الأكاديمي والمهني. تُعد كلية الآداب بجامعة
        عين شمس واحدة من أعرق الكليات الإنسانية في مصر والعالم العربي، حيث تم
        تأسيسها عام 1950 كأول كلية للآداب ضمن كليات جامعة عين شمس. منذ نشأتها،
        لعبت الكلية دورًا بارزًا في خدمة المجتمع وتنمية الفكر والثقافة من خلال
        تخريج كوادر متميزة في مختلف مجالات العلوم الإنسانية والاجتماعية. تسعى
        الكلية إلى إعداد خريجين متميزين علميًا ومهنيًا في مجالات العلوم
        الاجتماعية والإنسانية، مع مواكبة التطورات المعرفية والتكنولوجية، وتعزيز
        القيم المهنية والأخلاقية، فضلاً عن خدمة المجتمع وتنميته وفقًا لاحتياجات
        سوق العمل داخل مصر وخارجها، وترسيخ الانتماء والهوية الوطنية في نفوس
        الطلاب.
      </p>

      {/* Footer Section */}
      <p className="text-gray-600 mt-8 text-sm">
        نسعى دائماً إلى تقديم الأفضل لطلابنا ومجتمعنا من خلال برامج تعليمية
        متميزة وأبحاث علمية مبتكرة.
      </p>
    </div>
  );
};

export default AboutUs;
